#+title: Config
#+category: Config

** Fail lock
:LOGBOOK:
- Refiled on [2022-02-21 Mon 17:08]
:END:
[[https://wiki.archlinux.org/index.php/Security#Lock_out_user_after_three_failed_login_attempts][Security - ArchWiki]]

As per =/etc/security/faillock.conf=:

- unlock_time :: the lockout time (in seconds, default 10 minutes).
- fail_interval :: the time in which failed logins can cause a lockout (in seconds, default 15 minutes).
- deny :: the number of failed logins before lockout (default 3).
- =deny = 0= will disable lockout

#+begin_src shell :dir /sudo::
  echo "deny = 0" | tee -a /etc/security/faillock.conf
#+end_src

#+results:
: deny = 0

** Journald
:LOGBOOK:
- Refiled on [2022-02-21 Mon 17:10]
:END:
By default, journald can use up to 4 GB of storage for logs or something like that.

#+begin_src conf :tangle /sudo::/etc/systemd/system.conf.d/journald.conf
  SystemMaxUse=100M
#+end_src

And to check how much space the journal is currently using:

#+begin_src shell :results replace :tangle no
  journalctl --disk-usage
#+end_src

#+results:
: Archived and active journals take up 72.0M in the file system.

